let ErymetoD=['John', 'Bob', 'Nick', 'Bob','Mary', 'Bob','Bob','Sue', 'Ann','Bob']
let FiltArray=()=>{
   let got= ErymetoD.filter(mmk=> !mmk.includes("Bob"));

   console.log(got)

}
FiltArray()


//ამ შემთხვევაში მიზანი იყო რომ Bob სადაც იქნებოდა ამოგვეგდო შესაბამისად ეს რომ ჩვეულევბივი სტრინგი ყოფილიყო
//სხვაგვარდა ვიზამდით თუმცა ეს ერეია ამიტომაც დავიხმარე ფილტერი რომელიც მონაცემებს ფილტრავს შემდეგ მაშში შ
// ევქმენი ფუნქცია რომელიც 2 ჯერ გამოვიტანე mmk =>mmk მთავარი ბრძანება რაც ცლის ყველაფერს არის 
// ! ამით ვეუბნბეი რომ დაატრიალოს ანუ !--გარეშე მხოლოდ Bob-ს გამოიტანდა ხოლო ამით ვეუბნები რომ ეს უარყოფითშია
//და უნდა ამოიღოს შემდეგ ძირითად ფუნქციას რომელშიდაც ისრისებური ფუნქცია შევქმენი ვიძახებ  FiltArray()


