function factorialCalculator(number) {
    let result = 1
    for (let i = 1; i <= number; i++)
        result *= i
    return result
}
let wan = Number(prompt("enEtr namber:"))
let bigfunc = factorialCalculator(wan);
alert(bigfunc)




//მოსასმოენი //მოსასმოენი //მოსასმოენი //მოსასმოენი
// result-ს მიენიჭება i- მნიშვნელობა, i-ს მნიშვნელობა იცვლება თითოეულ იტერაციაზე, მაგ. 1-ზე იქნება 1, მერე 2 და.აშ


//განმარტება როდესაც აქ  result = 1 მრავლდება  i ზე ეს ნიშნამ=ვს რომ როდესაც i ++ რომ წერია
//რამდენიდაც გაიზრდებ იდენჯერ გაამრავლებს რეზულტი რომ იყოს 5  შესრულდება იქმადე სანამ i++ არ გახდება მეტი number
//შემდეგ  რამდენიდაც მოიმატებს  i  იმდენჯერ მოიმატებს eresul ტიც და შმდეგ შედეგი გამოიტანს  


// ფაქტორიალის გამოთვლა: // ფაქტორიალის გამოთვლა:// ფაქტორიალის გამოთვლა: აქედაამ!!
// რიცხვის ფაქტორიალი გამოითვლება ფორმულით:
// მაგალითად:5!=5×4×3×2×1=120
// 8!=8×7×6×5×4×3×2×1=40320


// i და result არ არიან ერთი და იგივე, თუმცა 
// ისინი დაკავშირებულნი არიან ციკლში, და i ციკლს მართავს, 
// ხოლო result ინახავს გამრავლების შედეგს.