// let everYthird=[1,2,3,4,5,6,7,8,9,10]

//  for(const Numbers of everYthird){
//     if( Numbers%3===0){
//         console.log(Numbers)
        
//     }


//  }
// else არ აქვს რადგან ავტომატურად ეგეც შესრულდებოდა იმ რიცხვებზე რომლებიც არ იყოფა 3 ზე შესაბამისად
//სხვაგვარად ვერ მოხერხდებოდა რადგან ან ელსიში რაიმე უნდა გამოვიდეს ან უბრალოდ არ ჭირდება ელსე რადგან ელსი ში
// რა პირობაც იქნება იმასაც გამოიტანს რადგნა პირობა აუყველას არ ერგება მხოლოდ 3 6 9 ქვემოთ სხვაგვარი ამაგალითებია მოყვანილი!


// let everYthird=[1,2,3,4,5,6,7,8,9,10]

//  for(const Numbers of everYthird){
//     if( Numbers%3===0){
//         console.log(Numbers)
        
//     } else {
//         console.log("არ იყოფა სამზე!!!")


//     }
//     }



// let everYthird = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];

// const numbersErray = () => {
//     return everYthird.filter((number) => number % 3 === 0); 
// };

// console.log(numbersErray())
// აქ გამოვიყენე ფუნქცია ისრისებური რომლის შემდეგაც გამოვიყენე return რომელიც აბრუნებს მიღებულ შედეგს
//და ხდება ფუნქციის გამოძახება კონსოლში